<|endoftext|>
<|pad|>
#
(
)
-
/
1
2
3
4
5
6
7
8
=
[Br;!R;C]
[Br;!R;N]
[Br;!R;O]
[C;!R;BrBrBrC]
[C;!R;BrBrBrCl]
[C;!R;BrBrBrF]
[C;!R;BrBrBrO]
[C;!R;BrBrBrS]
[C;!R;BrBrCC]
[C;!R;BrBrCF]
[C;!R;BrBrCO]
[C;!R;BrBrCP]
[C;!R;BrBrCS]
[C;!R;BrBrC]
[C;!R;BrBrClF]
[C;!R;BrCCC]
[C;!R;BrCC]
[C;!R;BrCClCl]
[C;!R;BrCCl]
[C;!R;BrCFF]
[C;!R;BrCF]
[C;!R;BrCN]
[C;!R;BrCOO]
[C;!R;BrCO]
[C;!R;BrCSi]
[C;!R;BrClClSi]
[C;!R;BrFFN]
[C;!R;BrFFP]
[C;!R;BrFFS]
[C;!R;BrNNN]
[C;!R;CCCC]
[C;!R;CCCCl]
[C;!R;CCCF]
[C;!R;CCCN]
[C;!R;CCCO]
[C;!R;CCCP]
[C;!R;CCCS]
[C;!R;CCCSi]
[C;!R;CCC]
[C;!R;CCClCl]
[C;!R;CCClF]
[C;!R;CCClO]
[C;!R;CCClS]
[C;!R;CCCl]
[C;!R;CCFF]
[C;!R;CCF]
[C;!R;CCI]
[C;!R;CCNN]
[C;!R;CCNO]
[C;!R;CCNP]
[C;!R;CCN]
[C;!R;CCOO]
[C;!R;CCOP]
[C;!R;CCOS]
[C;!R;CCOSi]
[C;!R;CCO]
[C;!R;CCP]
[C;!R;CCSS]
[C;!R;CCS]
[C;!R;CCSi]
[C;!R;CC]
[C;!R;CClClCl]
[C;!R;CClClF]
[C;!R;CClClN]
[C;!R;CClClO]
[C;!R;CClClP]
[C;!R;CClClS]
[C;!R;CClCl]
[C;!R;CClFF]
[C;!R;CClNN]
[C;!R;CClN]
[C;!R;CClO]
[C;!R;CClP]
[C;!R;CClS]
[C;!R;CFFF]
[C;!R;CFFI]
[C;!R;CFFN]
[C;!R;CFFO]
[C;!R;CFFP]
[C;!R;CFFS]
[C;!R;CFFSi]
[C;!R;CFF]
[C;!R;CFO]
[C;!R;CFPP]
[C;!R;CFP]
[C;!R;CFS]
[C;!R;CNN]
[C;!R;CNO]
[C;!R;CNP]
[C;!R;CNSS]
[C;!R;CNS]
[C;!R;CN]
[C;!R;COOO]
[C;!R;COO]
[C;!R;COPP]
[C;!R;COP]
[C;!R;COSS]
[C;!R;COS]
[C;!R;COSi]
[C;!R;CPP]
[C;!R;CSSS]
[C;!R;CSS]
[C;!R;CSi]
[C;!R;ClClClO]
[C;!R;ClClClP]
[C;!R;ClClClS]
[C;!R;ClClFS]
[C;!R;ClClNN]
[C;!R;ClClNO]
[C;!R;ClClSS]
[C;!R;ClClSiSi]
[C;!R;ClFFO]
[C;!R;FFFN]
[C;!R;FFFO]
[C;!R;FFFS]
[C;!R;FFIS]
[C;!R;FFNN]
[C;!R;FFNO]
[C;!R;FFNS]
[C;!R;FFNSi]
[C;!R;NNN]
[C;!R;NNOS]
[C;!R;NNO]
[C;!R;NNP]
[C;!R;NNS]
[C;!R;NN]
[C;!R;NOO]
[C;!R;NOP]
[C;!R;NOS]
[C;!R;NO]
[C;!R;NPS]
[C;!R;NSS]
[C;!R;NS]
[C;!R;NSi]
[C;!R;OOOP]
[C;!R;OOO]
[C;!R;OOP]
[C;!R;OOS]
[C;!R;OSS]
[C;!R;SSS]
[C;R;BrBrCC]
[C;R;BrBrCS]
[C;R;BrCCC]
[C;R;BrCCCl]
[C;R;BrCCN]
[C;R;BrCCS]
[C;R;BrCC]
[C;R;BrCN]
[C;R;BrCO]
[C;R;BrCS]
[C;R;BrNN]
[C;R;CCCC]
[C;R;CCCCl]
[C;R;CCCF]
[C;R;CCCI]
[C;R;CCCN]
[C;R;CCCO]
[C;R;CCCP]
[C;R;CCCS]
[C;R;CCCSi]
[C;R;CCC]
[C;R;CCClCl]
[C;R;CCClO]
[C;R;CCClS]
[C;R;CCCl]
[C;R;CCFF]
[C;R;CCF]
[C;R;CCI]
[C;R;CCNN]
[C;R;CCNO]
[C;R;CCNP]
[C;R;CCNS]
[C;R;CCN]
[C;R;CCOO]
[C;R;CCOP]
[C;R;CCOS]
[C;R;CCO]
[C;R;CCP]
[C;R;CCSS]
[C;R;CCSSi]
[C;R;CCS]
[C;R;CCSi]
[C;R;CC]
[C;R;CClClN]
[C;R;CClClS]
[C;R;CClN]
[C;R;CClS]
[C;R;CFFO]
[C;R;CFFS]
[C;R;CFN]
[C;R;CIN]
[C;R;CNNN]
[C;R;CNNO]
[C;R;CNN]
[C;R;CNOO]
[C;R;CNO]
[C;R;CNP]
[C;R;CNSS]
[C;R;CNS]
[C;R;COOO]
[C;R;COOS]
[C;R;COO]
[C;R;COS]
[C;R;CSSS]
[C;R;CSS]
[C;R;CSSi]
[C;R;ClNN]
[C;R;ClNO]
[C;R;FFOO]
[C;R;NNNN]
[C;R;NNN]
[C;R;NNOO]
[C;R;NNO]
[C;R;NNSS]
[C;R;NNS]
[C;R;NOO]
[C;R;NOS]
[C;R;NSS]
[C;R;OOO]
[C;R;OOS]
[C;R;OSS]
[C;R;SSS]
[CH2;!R;BrC]
[CH2;!R;BrS]
[CH2;!R;CC]
[CH2;!R;CCl]
[CH2;!R;CF]
[CH2;!R;CI]
[CH2;!R;CN]
[CH2;!R;CO]
[CH2;!R;CP]
[CH2;!R;CS]
[CH2;!R;CSi]
[CH2;!R;C]
[CH2;!R;ClS]
[CH2;!R;FN]
[CH2;!R;FO]
[CH2;!R;NN]
[CH2;!R;NO]
[CH2;!R;NP]
[CH2;!R;NS]
[CH2;!R;NSi]
[CH2;!R;OO]
[CH2;!R;OP]
[CH2;!R;OS]
[CH2;!R;OSi]
[CH2;!R;O]
[CH2;!R;PP]
[CH2;!R;PS]
[CH2;!R;PSi]
[CH2;!R;SS]
[CH2;!R;SSi]
[CH2;!R;S]
[CH2;!R;SiSi]
[CH2;R;CC]
[CH2;R;CN]
[CH2;R;CO]
[CH2;R;CP]
[CH2;R;CS]
[CH2;R;CSi]
[CH2;R;NN]
[CH2;R;NO]
[CH2;R;NP]
[CH2;R;NS]
[CH2;R;NSi]
[CH2;R;OO]
[CH2;R;OP]
[CH2;R;OS]
[CH2;R;PP]
[CH2;R;SS]
[CH3;!R;C]
[CH3;!R;N]
[CH3;!R;O]
[CH3;!R;P]
[CH3;!R;S]
[CH3;!R;Si]
[CH;!R;BrBrC]
[CH;!R;BrCC]
[CH;!R;BrC]
[CH;!R;CCC]
[CH;!R;CCCl]
[CH;!R;CCF]
[CH;!R;CCN]
[CH;!R;CCO]
[CH;!R;CCP]
[CH;!R;CCS]
[CH;!R;CCSi]
[CH;!R;CC]
[CH;!R;CClCl]
[CH;!R;CClN]
[CH;!R;CClP]
[CH;!R;CCl]
[CH;!R;CFF]
[CH;!R;CFS]
[CH;!R;CF]
[CH;!R;CI]
[CH;!R;CNN]
[CH;!R;CNO]
[CH;!R;CNP]
[CH;!R;CN]
[CH;!R;COO]
[CH;!R;CO]
[CH;!R;CPP]
[CH;!R;CPS]
[CH;!R;CP]
[CH;!R;CSS]
[CH;!R;CS]
[CH;!R;CSiSi]
[CH;!R;CSi]
[CH;!R;C]
[CH;!R;FFN]
[CH;!R;FFO]
[CH;!R;FFS]
[CH;!R;NNN]
[CH;!R;NNO]
[CH;!R;NNS]
[CH;!R;NN]
[CH;!R;NOO]
[CH;!R;NO]
[CH;!R;NPP]
[CH;!R;NSS]
[CH;!R;NS]
[CH;!R;NSiSi]
[CH;!R;N]
[CH;!R;OOO]
[CH;!R;OOP]
[CH;!R;OO]
[CH;!R;OS]
[CH;!R;SSS]
[CH;R;BrCC]
[CH;R;BrCN]
[CH;R;BrNS]
[CH;R;CCC]
[CH;R;CCCl]
[CH;R;CCF]
[CH;R;CCN]
[CH;R;CCO]
[CH;R;CCP]
[CH;R;CCS]
[CH;R;CCSi]
[CH;R;CC]
[CH;R;CClN]
[CH;R;CClO]
[CH;R;CClS]
[CH;R;CIN]
[CH;R;CNN]
[CH;R;CNO]
[CH;R;CNS]
[CH;R;CN]
[CH;R;COO]
[CH;R;CO]
[CH;R;CP]
[CH;R;CSS]
[CH;R;CS]
[CH;R;NNN]
[CH;R;NNO]
[CH;R;NNS]
[CH;R;NN]
[CH;R;NOO]
[CH;R;NO]
[CH;R;NSS]
[CH;R;NS]
[CH;R;OOO]
[CH;R;OOP]
[CH;R;PSS]
[CH;R;SSSi]
[Cl;!R;C]
[Cl;!R;N]
[Cl;!R;O]
[Cl;!R;P]
[Cl;!R;S]
[F;!R;C]
[F;!R;N]
[F;!R;S]
[I;!R;C]
[I;!R;N]
[N;!R;BrBrS]
[N;!R;BrCC]
[N;!R;CCC]
[N;!R;CCCl]
[N;!R;CCN]
[N;!R;CCO]
[N;!R;CCP]
[N;!R;CCS]
[N;!R;CCSi]
[N;!R;CC]
[N;!R;CClCl]
[N;!R;CFS]
[N;!R;CIS]
[N;!R;CNN]
[N;!R;CNO]
[N;!R;CNS]
[N;!R;CNSi]
[N;!R;CN]
[N;!R;COS]
[N;!R;CO]
[N;!R;CP]
[N;!R;CSS]
[N;!R;CS]
[N;!R;CSiSi]
[N;!R;C]
[N;!R;ClClS]
[N;!R;NNO]
[N;!R;NN]
[N;!R;NO]
[N;!R;NP]
[N;!R;NS]
[N;!R;N]
[N;!R;OSS]
[N;!R;PP]
[N;!R;PSi]
[N;!R;SS]
[N;!R;SSiSi]
[N;!R;SSi]
[N;R;BrCC]
[N;R;CCC]
[N;R;CCCl]
[N;R;CCF]
[N;R;CCI]
[N;R;CCN]
[N;R;CCO]
[N;R;CCP]
[N;R;CCS]
[N;R;CCSi]
[N;R;CC]
[N;R;CClS]
[N;R;CFS]
[N;R;CIS]
[N;R;CNN]
[N;R;CNO]
[N;R;CNP]
[N;R;CNS]
[N;R;CN]
[N;R;COO]
[N;R;COS]
[N;R;CO]
[N;R;CP]
[N;R;CSS]
[N;R;CS]
[N;R;CSiSi]
[N;R;FSS]
[N;R;NNN]
[N;R;NNO]
[N;R;NN]
[N;R;NO]
[N;R;NSS]
[N;R;NS]
[N;R;OS]
[N;R;PP]
[N;R;PS]
[N;R;SS]
[NH2;!R;C]
[NH2;!R;N]
[NH2;!R;O]
[NH2;!R;P]
[NH2;!R;S]
[NH2;!R;Si]
[NH;!R;BrC]
[NH;!R;CC]
[NH;!R;CCl]
[NH;!R;CN]
[NH;!R;CO]
[NH;!R;CP]
[NH;!R;CS]
[NH;!R;CSi]
[NH;!R;C]
[NH;!R;ClN]
[NH;!R;NN]
[NH;!R;NO]
[NH;!R;NP]
[NH;!R;NS]
[NH;!R;N]
[NH;!R;OP]
[NH;!R;OS]
[NH;!R;PP]
[NH;!R;P]
[NH;!R;SS]
[NH;!R;S]
[NH;!R;SiSi]
[NH;R;CC]
[NH;R;CN]
[NH;R;CO]
[NH;R;CP]
[NH;R;CS]
[NH;R;NN]
[NH;R;NO]
[NH;R;NS]
[NH;R;OS]
[O;!R;BrC]
[O;!R;CC]
[O;!R;CCl]
[O;!R;CN]
[O;!R;CP]
[O;!R;CS]
[O;!R;CSi]
[O;!R;C]
[O;!R;ClS]
[O;!R;NN]
[O;!R;NP]
[O;!R;NS]
[O;!R;N]
[O;!R;PP]
[O;!R;P]
[O;!R;SS]
[O;!R;S]
[O;R;CC]
[O;R;CN]
[O;R;CP]
[O;R;CS]
[O;R;NN]
[O;R;PP]
[OH;!R;C]
[OH;!R;N]
[OH;!R;P]
[OH;!R;S]
[P;!R;CCCO]
[P;!R;CCC]
[P;!R;CCNN]
[P;!R;CCNO]
[P;!R;CCN]
[P;!R;CCOO]
[P;!R;CCO]
[P;!R;CNNN]
[P;!R;CNNO]
[P;!R;CNN]
[P;!R;CNO]
[P;!R;COOO]
[P;!R;COO]
[P;!R;CO]
[P;!R;NNNN]
[P;!R;NNNO]
[P;!R;NNN]
[P;!R;NNOO]
[P;!R;NNO]
[P;!R;NN]
[P;!R;NOOO]
[P;!R;NOO]
[P;!R;OOOO]
[P;!R;OOO]
[P;R;CCCNN]
[P;R;CCCO]
[P;R;CCC]
[P;R;CCNO]
[P;R;CCOO]
[P;R;CNNN]
[P;R;CNNO]
[P;R;CNN]
[P;R;CNOOO]
[P;R;COOOO]
[P;R;COOO]
[P;R;NNNN]
[P;R;NNN]
[P;R;NNOO]
[P;R;NOOO]
[P;R;NOO]
[P;R;OOOO]
[P;R;OOO]
[PH2;!R;C]
[PH;!R;CCCC]
[PH;!R;CCO]
[PH;!R;CC]
[PH;!R;CO]
[PH;!R;OOO]
[PH;R;CCCC]
[PH;R;CC]
[PH;R;NNOO]
[PH;R;NOOO]
[PH;R;OOOO]
[PH;R;OOO]
[S;!R;CCCN]
[S;!R;CCCO]
[S;!R;CCC]
[S;!R;CCNO]
[S;!R;CCN]
[S;!R;CCOO]
[S;!R;CCO]
[S;!R;CC]
[S;!R;CClOO]
[S;!R;CFOO]
[S;!R;CNN]
[S;!R;CNOO]
[S;!R;CN]
[S;!R;COOO]
[S;!R;COO]
[S;!R;CO]
[S;!R;CS]
[S;!R;CSi]
[S;!R;C]
[S;!R;NNN]
[S;!R;NNOO]
[S;!R;NNO]
[S;!R;NN]
[S;!R;NOOO]
[S;!R;NO]
[S;!R;N]
[S;!R;OOOO]
[S;!R;OOO]
[S;!R;S]
[S;R;CCC]
[S;R;CCNN]
[S;R;CCNO]
[S;R;CCN]
[S;R;CCOO]
[S;R;CCO]
[S;R;CC]
[S;R;CNN]
[S;R;CNOO]
[S;R;CNO]
[S;R;CNS]
[S;R;CN]
[S;R;COOO]
[S;R;COO]
[S;R;CS]
[S;R;NNNO]
[S;R;NNN]
[S;R;NNOO]
[S;R;NN]
[S;R;NOOO]
[SH;!R;CCNO]
[SH;!R;C]
[SH;!R;NNO]
[SH;!R;NOO]
[SH;!R;N]
[SH;!R;OOO]
[Si;!R;CCCC]
[Si;!R;CCCN]
[Si;!R;CCCO]
[Si;!R;CCCS]
[Si;!R;CCCSi]
[Si;!R;CCC]
[Si;!R;CCSiSi]
[Si;!R;CCSi]
[Si;!R;CSiSiSi]
[Si;!R;SSSS]
[Si;!R;SiSiSiSi]
[Si;!R;SiSiSi]
[Si;R;CCCC]
[Si;R;CCNN]
[[C@@H];!R;BrCC]
[[C@@H];!R;CCC]
[[C@@H];!R;CCCl]
[[C@@H];!R;CCF]
[[C@@H];!R;CCN]
[[C@@H];!R;CCO]
[[C@@H];!R;CCP]
[[C@@H];!R;CCS]
[[C@@H];!R;CCSi]
[[C@@H];!R;CClS]
[[C@@H];!R;CFN]
[[C@@H];!R;CFO]
[[C@@H];!R;CFP]
[[C@@H];!R;CFS]
[[C@@H];!R;CNN]
[[C@@H];!R;CNO]
[[C@@H];!R;CNP]
[[C@@H];!R;CNS]
[[C@@H];!R;CNSi]
[[C@@H];!R;COO]
[[C@@H];!R;COP]
[[C@@H];!R;COS]
[[C@@H];!R;CPS]
[[C@@H];!R;CSS]
[[C@@H];!R;FNO]
[[C@@H];!R;NNN]
[[C@@H];!R;NNO]
[[C@@H];!R;NOO]
[[C@@H];!R;SSS]
[[C@@H];R;BrCC]
[[C@@H];R;CCC]
[[C@@H];R;CCCl]
[[C@@H];R;CCF]
[[C@@H];R;CCN]
[[C@@H];R;CCO]
[[C@@H];R;CCP]
[[C@@H];R;CCS]
[[C@@H];R;CCSi]
[[C@@H];R;CClN]
[[C@@H];R;CFO]
[[C@@H];R;CNN]
[[C@@H];R;CNO]
[[C@@H];R;CNP]
[[C@@H];R;CNS]
[[C@@H];R;CNSi]
[[C@@H];R;COO]
[[C@@H];R;COP]
[[C@@H];R;COS]
[[C@@H];R;CPS]
[[C@@H];R;CSS]
[[C@@H];R;NNN]
[[C@@H];R;NNO]
[[C@@H];R;NNS]
[[C@@H];R;NOO]
[[C@@H];R;NOS]
[[C@@H];R;NSS]
[[C@@H];R;OOO]
[[C@@];!R;BrCCC]
[[C@@];!R;BrCCCl]
[[C@@];!R;BrCCF]
[[C@@];!R;BrCCN]
[[C@@];!R;BrCCO]
[[C@@];!R;BrCCS]
[[C@@];!R;BrCClF]
[[C@@];!R;BrCClS]
[[C@@];!R;BrCFO]
[[C@@];!R;BrCIS]
[[C@@];!R;CCCC]
[[C@@];!R;CCCCl]
[[C@@];!R;CCCF]
[[C@@];!R;CCCN]
[[C@@];!R;CCCO]
[[C@@];!R;CCCS]
[[C@@];!R;CCCSi]
[[C@@];!R;CCClF]
[[C@@];!R;CCClN]
[[C@@];!R;CCClO]
[[C@@];!R;CCClS]
[[C@@];!R;CCFN]
[[C@@];!R;CCFO]
[[C@@];!R;CCFS]
[[C@@];!R;CCNN]
[[C@@];!R;CCNO]
[[C@@];!R;CCNP]
[[C@@];!R;CCOO]
[[C@@];!R;CCOP]
[[C@@];!R;CClFI]
[[C@@];!R;CClFO]
[[C@@];!R;CClIS]
[[C@@];!R;CFPS]
[[C@@];!R;COPP]
[[C@@];R;BrCCC]
[[C@@];R;BrCCCl]
[[C@@];R;BrCCF]
[[C@@];R;BrCCN]
[[C@@];R;BrCCO]
[[C@@];R;BrCCS]
[[C@@];R;CCCC]
[[C@@];R;CCCCl]
[[C@@];R;CCCF]
[[C@@];R;CCCI]
[[C@@];R;CCCN]
[[C@@];R;CCCO]
[[C@@];R;CCCP]
[[C@@];R;CCCS]
[[C@@];R;CCCSi]
[[C@@];R;CCClF]
[[C@@];R;CCClO]
[[C@@];R;CCClS]
[[C@@];R;CCClSi]
[[C@@];R;CCFN]
[[C@@];R;CCFO]
[[C@@];R;CCFS]
[[C@@];R;CCNN]
[[C@@];R;CCNO]
[[C@@];R;CCNS]
[[C@@];R;CCOO]
[[C@@];R;CCOP]
[[C@@];R;CCOS]
[[C@@];R;CCOSi]
[[C@@];R;CCSS]
[[C@@];R;CCSSi]
[[C@@];R;CINO]
[[C@@];R;CNNO]
[[C@@];R;CNNS]
[[C@@];R;CNOO]
[[C@@];R;CNOS]
[[C@@];R;CNSS]
[[C@@];R;COOO]
[[C@@];R;COOS]
[[C@@];R;COSS]
[[C@@];R;NNNO]
[[C@@];R;NNNS]
[[C@@];R;NNOS]
[[C@@];R;NNSS]
[[C@@];R;OOOS]
[[C@H];!R;BrCC]
[[C@H];!R;CCC]
[[C@H];!R;CCCl]
[[C@H];!R;CCF]
[[C@H];!R;CCN]
[[C@H];!R;CCO]
[[C@H];!R;CCP]
[[C@H];!R;CCS]
[[C@H];!R;CCSi]
[[C@H];!R;CClS]
[[C@H];!R;CFN]
[[C@H];!R;CFO]
[[C@H];!R;CFS]
[[C@H];!R;CNN]
[[C@H];!R;CNO]
[[C@H];!R;CNP]
[[C@H];!R;CNS]
[[C@H];!R;CNSi]
[[C@H];!R;COO]
[[C@H];!R;COP]
[[C@H];!R;COS]
[[C@H];!R;COSi]
[[C@H];!R;CSS]
[[C@H];!R;CSSi]
[[C@H];!R;FNO]
[[C@H];!R;NNN]
[[C@H];!R;NOO]
[[C@H];R;BrCC]
[[C@H];R;CCC]
[[C@H];R;CCCl]
[[C@H];R;CCF]
[[C@H];R;CCI]
[[C@H];R;CCN]
[[C@H];R;CCO]
[[C@H];R;CCP]
[[C@H];R;CCS]
[[C@H];R;CCSi]
[[C@H];R;CFO]
[[C@H];R;CNN]
[[C@H];R;CNO]
[[C@H];R;CNP]
[[C@H];R;CNS]
[[C@H];R;CNSi]
[[C@H];R;COO]
[[C@H];R;COP]
[[C@H];R;COS]
[[C@H];R;CPS]
[[C@H];R;CSS]
[[C@H];R;NNN]
[[C@H];R;NNO]
[[C@H];R;NNS]
[[C@H];R;NOO]
[[C@H];R;NOS]
[[C@H];R;NSS]
[[C@H];R;OOO]
[[C@];!R;BrCCC]
[[C@];!R;BrCCCl]
[[C@];!R;BrCCF]
[[C@];!R;BrCCO]
[[C@];!R;BrCCS]
[[C@];!R;BrCClF]
[[C@];!R;BrCClS]
[[C@];!R;BrCFO]
[[C@];!R;BrCIS]
[[C@];!R;CCCC]
[[C@];!R;CCCCl]
[[C@];!R;CCCF]
[[C@];!R;CCCN]
[[C@];!R;CCCO]
[[C@];!R;CCCS]
[[C@];!R;CCCSi]
[[C@];!R;CCClF]
[[C@];!R;CCClN]
[[C@];!R;CCClO]
[[C@];!R;CCClS]
[[C@];!R;CCFN]
[[C@];!R;CCFO]
[[C@];!R;CCFS]
[[C@];!R;CCNN]
[[C@];!R;CCNO]
[[C@];!R;CCNP]
[[C@];!R;CCNS]
[[C@];!R;CCOO]
[[C@];!R;CCOP]
[[C@];!R;CClFO]
[[C@];!R;CClFS]
[[C@];!R;CClIS]
[[C@];!R;CFPS]
[[C@];!R;COPP]
[[C@];R;BrCCC]
[[C@];R;BrCCCl]
[[C@];R;BrCCF]
[[C@];R;BrCCN]
[[C@];R;BrCCO]
[[C@];R;CCCC]
[[C@];R;CCCCl]
[[C@];R;CCCF]
[[C@];R;CCCI]
[[C@];R;CCCN]
[[C@];R;CCCO]
[[C@];R;CCCP]
[[C@];R;CCCS]
[[C@];R;CCCSi]
[[C@];R;CCClF]
[[C@];R;CCClN]
[[C@];R;CCClO]
[[C@];R;CCClP]
[[C@];R;CCClS]
[[C@];R;CCFN]
[[C@];R;CCFO]
[[C@];R;CCFS]
[[C@];R;CCNN]
[[C@];R;CCNO]
[[C@];R;CCNP]
[[C@];R;CCNS]
[[C@];R;CCNSi]
[[C@];R;CCOO]
[[C@];R;CCOP]
[[C@];R;CCOS]
[[C@];R;CCOSi]
[[C@];R;CCSS]
[[C@];R;CCSSi]
[[C@];R;CINO]
[[C@];R;CNNO]
[[C@];R;CNNS]
[[C@];R;CNOO]
[[C@];R;CNOS]
[[C@];R;COOO]
[[C@];R;COOS]
[[C@];R;NNNO]
[[C@];R;NNNS]
[[C@];R;NNOS]
[[C@];R;NNSS]
[[C@];R;OOOS]
[[N+];!R;CCCC]
[[N+];!R;CCC]
[[N+];!R;CCO]
[[N+];!R;CCS]
[[N+];!R;CC]
[[N+];!R;CNO]
[[N+];!R;CN]
[[N+];!R;COO]
[[N+];!R;COS]
[[N+];!R;NNO]
[[N+];!R;NN]
[[N+];!R;NOO]
[[N+];!R;OOO]
[[N+];R;CCC]
[[N+];R;CCN]
[[N+];R;CCO]
[[N+];R;CCS]
[[N+];R;CNN]
[[N+];R;CNO]
[[N+];R;COO]
[[N+];R;NNO]
[[N+];R;NOO]
[[N-];!R;CN]
[[N-];!R;NN]
[[N-];!R;NO]
[[N-];!R;NS]
[[N-];!R;N]
[[N-];R;CN]
[[N@@];R;CCC]
[[N@];R;CCC]
[[NH+];!R;CN]
[[NH+];R;CN]
[[O+];R;CN]
[[O-];!R;N]
[[P@@H];!R;COO]
[[P@@H];!R;OOO]
[[P@@H];R;CCO]
[[P@@H];R;COO]
[[P@@H];R;NNO]
[[P@@];!R;CCCO]
[[P@@];!R;CCNN]
[[P@@];!R;CCNO]
[[P@@];!R;CCOO]
[[P@@];!R;CNNO]
[[P@@];!R;CNN]
[[P@@];!R;CNOO]
[[P@@];!R;COOO]
[[P@@];!R;NNOO]
[[P@@];!R;NOOO]
[[P@@];!R;OOOO]
[[P@@];R;CCCO]
[[P@@];R;CCC]
[[P@@];R;CCNO]
[[P@@];R;CCOO]
[[P@@];R;CNNN]
[[P@@];R;CNNO]
[[P@@];R;CNOO]
[[P@@];R;COOO]
[[P@@];R;NNNN]
[[P@@];R;NNOO]
[[P@@];R;NOOO]
[[P@@];R;OOOO]
[[P@H];!R;CCO]
[[P@H];!R;COO]
[[P@H];!R;OOO]
[[P@H];R;COO]
[[P@H];R;NNO]
[[P@];!R;CCCO]
[[P@];!R;CCNN]
[[P@];!R;CCNO]
[[P@];!R;CCOO]
[[P@];!R;CNNO]
[[P@];!R;CNN]
[[P@];!R;CNOO]
[[P@];!R;COOO]
[[P@];!R;NOOO]
[[P@];!R;OOOO]
[[P@];R;CCCO]
[[P@];R;CCC]
[[P@];R;CCNO]
[[P@];R;CCOO]
[[P@];R;CNNN]
[[P@];R;CNNO]
[[P@];R;CNOO]
[[P@];R;COOO]
[[P@];R;NNNN]
[[P@];R;NNOO]
[[P@];R;NOOO]
[[P@];R;OOOO]
[[S+];!R;CC]
[[S@@];!R;CCNO]
[[S@@];!R;CCN]
[[S@@];!R;CCO]
[[S@@];!R;CNNO]
[[S@@];!R;CNN]
[[S@@];!R;CNOO]
[[S@@];!R;CNO]
[[S@@];!R;COOS]
[[S@@];!R;COO]
[[S@@];!R;NNO]
[[S@@];!R;NOO]
[[S@@];R;CCNO]
[[S@@];R;CCO]
[[S@@];R;CNO]
[[S@@];R;COO]
[[S@@];R;NNO]
[[S@];!R;CCNO]
[[S@];!R;CCN]
[[S@];!R;CCO]
[[S@];!R;CNNO]
[[S@];!R;CNN]
[[S@];!R;CNOO]
[[S@];!R;CNO]
[[S@];!R;COOS]
[[S@];!R;COO]
[[S@];!R;NNO]
[[S@];!R;NOO]
[[S@];R;CCNO]
[[S@];R;CCN]
[[S@];R;CCO]
[[S@];R;CNN]
[[S@];R;CNO]
[[S@];R;COO]
[[S@];R;NNO]
[[S@];R;NOO]
[[[S@]+];!R;CCC]
[[n+];R;CCC]
[[n+];R;CCF]
[[n+];R;CCN]
[[n+];R;CCO]
[[n+];R;CCS]
[[n+];R;CNN]
[[n+];R;CNO]
[[n+];R;COO]
[[n+];R;NNN]
[[n+];R;NOO]
[[n-];R;CN]
[[n-];R;NN]
[[n-];R;NO]
[[nH+];R;CN]
[[o+];R;CC]
[[o+];R;CN]
[[s+];R;CCC]
[[s+];R;CC]
[[s+];R;CN]
[[s+];R;CS]
[[s+];R;NS]
[c;R;BrCC]
[c;R;BrCN]
[c;R;BrCO]
[c;R;BrCS]
[c;R;BrNN]
[c;R;BrNO]
[c;R;BrNS]
[c;R;CCC]
[c;R;CCCl]
[c;R;CCF]
[c;R;CCI]
[c;R;CCN]
[c;R;CCO]
[c;R;CCP]
[c;R;CCS]
[c;R;CCSi]
[c;R;CClN]
[c;R;CClO]
[c;R;CClS]
[c;R;CFN]
[c;R;CFO]
[c;R;CFS]
[c;R;CIN]
[c;R;CIO]
[c;R;CIS]
[c;R;CNN]
[c;R;CNO]
[c;R;CNP]
[c;R;CNS]
[c;R;CNSi]
[c;R;COO]
[c;R;COP]
[c;R;COS]
[c;R;COSi]
[c;R;CPS]
[c;R;CSS]
[c;R;CSSi]
[c;R;ClNN]
[c;R;ClNO]
[c;R;ClNS]
[c;R;FNN]
[c;R;INN]
[c;R;INO]
[c;R;INS]
[c;R;NNN]
[c;R;NNO]
[c;R;NNP]
[c;R;NNS]
[c;R;NNSi]
[c;R;NOO]
[c;R;NOS]
[c;R;NOSi]
[c;R;NPS]
[c;R;NSS]
[c;R;NSSi]
[c;R;OOO]
[c;R;OOS]
[c;R;OSS]
[c;R;SSS]
[cH;R;CC]
[cH;R;CN]
[cH;R;CO]
[cH;R;CS]
[cH;R;NN]
[cH;R;NO]
[cH;R;NS]
[n;R;BrCC]
[n;R;BrCN]
[n;R;CCC]
[n;R;CCCl]
[n;R;CCF]
[n;R;CCN]
[n;R;CCO]
[n;R;CCP]
[n;R;CCS]
[n;R;CCSi]
[n;R;CC]
[n;R;CNN]
[n;R;CNO]
[n;R;CNP]
[n;R;CNS]
[n;R;CN]
[n;R;COS]
[n;R;CO]
[n;R;CS]
[n;R;NNN]
[n;R;NN]
[n;R;NO]
[n;R;NS]
[nH;R;CC]
[nH;R;CN]
[nH;R;CO]
[nH;R;CS]
[nH;R;NN]
[nH;R;NS]
[o;R;CC]
[o;R;CN]
[o;R;CS]
[o;R;NN]
[p;R;CCC]
[p;R;CCCl]
[p;R;CC]
[s;R;CC]
[s;R;CN]
[s;R;CO]
[s;R;CS]
[s;R;NN]
[s;R;NS]
\
