#
(
)
-
/
1
2
3
4
5
6
7
=
[Br;!R;C]
[Br;!R;N]
[C;!R;BrBrBrC]
[C;!R;BrBrCF]
[C;!R;BrBrCS]
[C;!R;BrCCC]
[C;!R;BrCC]
[C;!R;BrCFF]
[C;!R;BrCN]
[C;!R;CCCC]
[C;!R;CCCCl]
[C;!R;CCCF]
[C;!R;CCCN]
[C;!R;CCCO]
[C;!R;CCCP]
[C;!R;CCCS]
[C;!R;CCC]
[C;!R;CCClCl]
[C;!R;CCClO]
[C;!R;CCCl]
[C;!R;CCFF]
[C;!R;CCF]
[C;!R;CCI]
[C;!R;CCNN]
[C;!R;CCNO]
[C;!R;CCN]
[C;!R;CCOO]
[C;!R;CCO]
[C;!R;CCP]
[C;!R;CCSS]
[C;!R;CCS]
[C;!R;CC]
[C;!R;CClClCl]
[C;!R;CClClF]
[C;!R;CClClO]
[C;!R;CClClS]
[C;!R;CClCl]
[C;!R;CClFF]
[C;!R;CClN]
[C;!R;CFFF]
[C;!R;CFFI]
[C;!R;CFFN]
[C;!R;CFFO]
[C;!R;CFFP]
[C;!R;CFFS]
[C;!R;CFF]
[C;!R;CFS]
[C;!R;CNN]
[C;!R;CNO]
[C;!R;CNP]
[C;!R;CNS]
[C;!R;CN]
[C;!R;COO]
[C;!R;COS]
[C;!R;COSi]
[C;!R;CO]
[C;!R;CSSS]
[C;!R;CSS]
[C;!R;ClClClO]
[C;!R;ClClClS]
[C;!R;ClClFS]
[C;!R;ClClNO]
[C;!R;ClFFO]
[C;!R;FFFN]
[C;!R;FFFO]
[C;!R;FFFS]
[C;!R;FFNO]
[C;!R;FFNS]
[C;!R;NNN]
[C;!R;NNO]
[C;!R;NNS]
[C;!R;NN]
[C;!R;NOO]
[C;!R;NOP]
[C;!R;NOS]
[C;!R;NSS]
[C;!R;NS]
[C;!R;OOO]
[C;!R;OOS]
[C;!R;OSS]
[C;R;BrBrCC]
[C;R;BrBrCS]
[C;R;BrCCC]
[C;R;BrCC]
[C;R;BrCN]
[C;R;BrCS]
[C;R;CCCC]
[C;R;CCCCl]
[C;R;CCCF]
[C;R;CCCN]
[C;R;CCCO]
[C;R;CCCS]
[C;R;CCCSi]
[C;R;CCC]
[C;R;CCClCl]
[C;R;CCClO]
[C;R;CCCl]
[C;R;CCFF]
[C;R;CCF]
[C;R;CCNN]
[C;R;CCNO]
[C;R;CCNP]
[C;R;CCNS]
[C;R;CCN]
[C;R;CCOO]
[C;R;CCOS]
[C;R;CCO]
[C;R;CCSS]
[C;R;CCS]
[C;R;CClN]
[C;R;CClS]
[C;R;CFFO]
[C;R;CIN]
[C;R;CNNO]
[C;R;CNN]
[C;R;CNOO]
[C;R;CNO]
[C;R;CNS]
[C;R;COO]
[C;R;COS]
[C;R;CSS]
[C;R;ClClNS]
[C;R;ClNN]
[C;R;FFOO]
[C;R;NNN]
[C;R;NNO]
[C;R;NNS]
[C;R;NOO]
[C;R;NOS]
[C;R;NSS]
[C;R;OOO]
[C;R;OOS]
[CH2;!R;BrC]
[CH2;!R;BrS]
[CH2;!R;CC]
[CH2;!R;CCl]
[CH2;!R;CF]
[CH2;!R;CI]
[CH2;!R;CN]
[CH2;!R;CO]
[CH2;!R;CP]
[CH2;!R;CS]
[CH2;!R;CSi]
[CH2;!R;C]
[CH2;!R;FO]
[CH2;!R;NN]
[CH2;!R;NO]
[CH2;!R;NP]
[CH2;!R;NS]
[CH2;!R;NSi]
[CH2;!R;OO]
[CH2;!R;OP]
[CH2;!R;OS]
[CH2;!R;OSi]
[CH2;!R;PS]
[CH2;!R;SS]
[CH2;!R;SSi]
[CH2;R;CC]
[CH2;R;CN]
[CH2;R;CO]
[CH2;R;CS]
[CH2;R;CSi]
[CH2;R;NN]
[CH2;R;NO]
[CH2;R;NP]
[CH2;R;NS]
[CH2;R;NSi]
[CH2;R;OO]
[CH2;R;OP]
[CH2;R;OS]
[CH2;R;SS]
[CH3;!R;C]
[CH3;!R;N]
[CH3;!R;O]
[CH3;!R;P]
[CH3;!R;S]
[CH3;!R;Si]
[CH;!R;BrC]
[CH;!R;CCC]
[CH;!R;CCF]
[CH;!R;CCN]
[CH;!R;CCO]
[CH;!R;CCP]
[CH;!R;CCS]
[CH;!R;CCSi]
[CH;!R;CC]
[CH;!R;CCl]
[CH;!R;CFF]
[CH;!R;CF]
[CH;!R;CI]
[CH;!R;CNN]
[CH;!R;CNO]
[CH;!R;CN]
[CH;!R;COO]
[CH;!R;CO]
[CH;!R;CP]
[CH;!R;CSS]
[CH;!R;CS]
[CH;!R;CSi]
[CH;!R;C]
[CH;!R;FFN]
[CH;!R;FFO]
[CH;!R;FFS]
[CH;!R;NNN]
[CH;!R;NN]
[CH;!R;NOO]
[CH;!R;NO]
[CH;!R;NSiSi]
[CH;!R;N]
[CH;!R;OO]
[CH;!R;PSS]
[CH;R;CCC]
[CH;R;CCCl]
[CH;R;CCF]
[CH;R;CCN]
[CH;R;CCO]
[CH;R;CCP]
[CH;R;CCS]
[CH;R;CC]
[CH;R;CClN]
[CH;R;CNN]
[CH;R;CNO]
[CH;R;CNS]
[CH;R;CN]
[CH;R;COO]
[CH;R;CO]
[CH;R;CP]
[CH;R;CSS]
[CH;R;CS]
[CH;R;NNN]
[CH;R;NNO]
[CH;R;NNS]
[CH;R;NN]
[CH;R;NOO]
[CH;R;NO]
[CH;R;NS]
[Cl;!R;C]
[Cl;!R;N]
[Cl;!R;S]
[F;!R;C]
[F;!R;N]
[I;!R;C]
[N;!R;CCC]
[N;!R;CCN]
[N;!R;CCO]
[N;!R;CCP]
[N;!R;CCS]
[N;!R;CC]
[N;!R;CNS]
[N;!R;CN]
[N;!R;COS]
[N;!R;CO]
[N;!R;CP]
[N;!R;CSS]
[N;!R;CS]
[N;!R;CSiSi]
[N;!R;C]
[N;!R;ClClS]
[N;!R;NNO]
[N;!R;NO]
[N;!R;N]
[N;!R;SS]
[N;R;BrCC]
[N;R;CCC]
[N;R;CCCl]
[N;R;CCN]
[N;R;CCO]
[N;R;CCP]
[N;R;CCS]
[N;R;CC]
[N;R;CNN]
[N;R;CNO]
[N;R;CNS]
[N;R;CN]
[N;R;COO]
[N;R;COS]
[N;R;CO]
[N;R;CP]
[N;R;CS]
[N;R;NNO]
[N;R;NN]
[N;R;NO]
[N;R;PP]
[NH2;!R;C]
[NH2;!R;N]
[NH2;!R;O]
[NH2;!R;S]
[NH;!R;CC]
[NH;!R;CN]
[NH;!R;CO]
[NH;!R;CP]
[NH;!R;CS]
[NH;!R;C]
[NH;!R;NP]
[NH;!R;NS]
[NH;!R;OS]
[NH;!R;S]
[NH;R;CC]
[NH;R;CN]
[NH;R;CO]
[NH;R;CS]
[NH;R;NN]
[O;!R;CC]
[O;!R;CN]
[O;!R;CP]
[O;!R;CS]
[O;!R;C]
[O;!R;NN]
[O;!R;N]
[O;!R;P]
[O;!R;S]
[O;R;CC]
[O;R;CN]
[O;R;CP]
[O;R;CS]
[O;R;NN]
[OH;!R;C]
[OH;!R;N]
[OH;!R;P]
[P;!R;CCCO]
[P;!R;CCC]
[P;!R;CCN]
[P;!R;CNNN]
[P;!R;CNNO]
[P;!R;COOO]
[P;!R;NNOO]
[P;!R;NOOO]
[P;!R;OOOO]
[P;!R;OOO]
[P;R;CCCN]
[P;R;CCNO]
[P;R;CCOO]
[P;R;COOOO]
[P;R;COOO]
[P;R;NNNN]
[P;R;NNN]
[P;R;NOOO]
[P;R;NOO]
[P;R;OOOOO]
[P;R;OOO]
[PH;!R;CC]
[S;!R;CCNO]
[S;!R;CCOO]
[S;!R;CCO]
[S;!R;CC]
[S;!R;CClOO]
[S;!R;CNOO]
[S;!R;CN]
[S;!R;COOO]
[S;!R;CO]
[S;!R;C]
[S;!R;NNOO]
[S;!R;NN]
[S;!R;NOOO]
[S;!R;OOOO]
[S;R;CCNO]
[S;R;CCOO]
[S;R;CCO]
[S;R;CC]
[S;R;CNOO]
[S;R;CN]
[S;R;COOO]
[S;R;CS]
[S;R;NNN]
[S;R;NNOO]
[S;R;NN]
[SH;!R;C]
[SH;!R;NOO]
[Si;!R;CCCC]
[Si;!R;CCCN]
[Si;R;CCCC]
[[C@@H];!R;BrCC]
[[C@@H];!R;CCC]
[[C@@H];!R;CCF]
[[C@@H];!R;CCN]
[[C@@H];!R;CCO]
[[C@@H];!R;CCP]
[[C@@H];!R;CCS]
[[C@@H];!R;CClS]
[[C@@H];!R;CFN]
[[C@@H];!R;CFO]
[[C@@H];!R;CFS]
[[C@@H];!R;CNN]
[[C@@H];!R;CNO]
[[C@@H];!R;CNP]
[[C@@H];!R;CNS]
[[C@@H];!R;COO]
[[C@@H];!R;COP]
[[C@@H];!R;COS]
[[C@@H];!R;FNO]
[[C@@H];!R;NOO]
[[C@@H];R;CCC]
[[C@@H];R;CCF]
[[C@@H];R;CCN]
[[C@@H];R;CCO]
[[C@@H];R;CCS]
[[C@@H];R;CNN]
[[C@@H];R;CNO]
[[C@@H];R;CNS]
[[C@@H];R;COO]
[[C@@H];R;COS]
[[C@@H];R;CSS]
[[C@@H];R;NNN]
[[C@@H];R;NNS]
[[C@@H];R;NOO]
[[C@@];!R;BrCCCl]
[[C@@];!R;BrCCI]
[[C@@];!R;BrCCS]
[[C@@];!R;BrCClS]
[[C@@];!R;CCCC]
[[C@@];!R;CCCF]
[[C@@];!R;CCCN]
[[C@@];!R;CCCO]
[[C@@];!R;CCCS]
[[C@@];!R;CCClF]
[[C@@];!R;CCClS]
[[C@@];!R;CCFN]
[[C@@];!R;CCNN]
[[C@@];!R;CCNO]
[[C@@];!R;CCNP]
[[C@@];!R;CCOO]
[[C@@];!R;CCOP]
[[C@@];!R;CClFI]
[[C@@];!R;CClFO]
[[C@@];!R;CClIS]
[[C@@];R;BrCCC]
[[C@@];R;BrCCN]
[[C@@];R;BrCCO]
[[C@@];R;CCCC]
[[C@@];R;CCCCl]
[[C@@];R;CCCF]
[[C@@];R;CCCN]
[[C@@];R;CCCO]
[[C@@];R;CCCS]
[[C@@];R;CCClF]
[[C@@];R;CCClN]
[[C@@];R;CCFN]
[[C@@];R;CCNN]
[[C@@];R;CCNO]
[[C@@];R;CCNS]
[[C@@];R;CCOO]
[[C@@];R;CCOP]
[[C@@];R;CCOS]
[[C@@];R;CCSSi]
[[C@@];R;CFOO]
[[C@@];R;CNNO]
[[C@@];R;CNOO]
[[C@@];R;NNSS]
[[C@H];!R;BrCC]
[[C@H];!R;CCC]
[[C@H];!R;CCF]
[[C@H];!R;CCN]
[[C@H];!R;CCO]
[[C@H];!R;CCP]
[[C@H];!R;CCS]
[[C@H];!R;CClS]
[[C@H];!R;CFN]
[[C@H];!R;CNN]
[[C@H];!R;CNO]
[[C@H];!R;CNP]
[[C@H];!R;CNS]
[[C@H];!R;COO]
[[C@H];!R;COP]
[[C@H];!R;COS]
[[C@H];!R;FNO]
[[C@H];R;BrCC]
[[C@H];R;CCC]
[[C@H];R;CCF]
[[C@H];R;CCN]
[[C@H];R;CCO]
[[C@H];R;CCP]
[[C@H];R;CCS]
[[C@H];R;CNN]
[[C@H];R;CNO]
[[C@H];R;CNS]
[[C@H];R;COO]
[[C@H];R;COS]
[[C@H];R;NNO]
[[C@H];R;NNS]
[[C@H];R;NOO]
[[C@H];R;OOO]
[[C@];!R;BrCCF]
[[C@];!R;BrCCS]
[[C@];!R;BrCClS]
[[C@];!R;BrCIS]
[[C@];!R;CCCC]
[[C@];!R;CCCCl]
[[C@];!R;CCCF]
[[C@];!R;CCCN]
[[C@];!R;CCCO]
[[C@];!R;CCCS]
[[C@];!R;CCClF]
[[C@];!R;CCClO]
[[C@];!R;CCClS]
[[C@];!R;CCFN]
[[C@];!R;CCFO]
[[C@];!R;CCNN]
[[C@];!R;CCNO]
[[C@];!R;CClFO]
[[C@];!R;CClIS]
[[C@];R;BrCCC]
[[C@];R;BrCCCl]
[[C@];R;CCCC]
[[C@];R;CCCCl]
[[C@];R;CCCF]
[[C@];R;CCCI]
[[C@];R;CCCN]
[[C@];R;CCCO]
[[C@];R;CCCS]
[[C@];R;CCClF]
[[C@];R;CCFN]
[[C@];R;CCNN]
[[C@];R;CCNO]
[[C@];R;CCNS]
[[C@];R;CCOO]
[[C@];R;CCOP]
[[C@];R;CCOSi]
[[C@];R;CNNO]
[[C@];R;CNNS]
[[C@];R;CNOO]
[[C@];R;NNNS]
[[C@];R;NNSS]
[[N+];!R;CCC]
[[N+];!R;CC]
[[N+];!R;CN]
[[N+];!R;COO]
[[N+];!R;NN]
[[N+];!R;NOO]
[[N+];!R;OOO]
[[N+];R;CCC]
[[N+];R;CCN]
[[N+];R;CCO]
[[N+];R;NNO]
[[N+];R;NOO]
[[N-];!R;CC]
[[N-];!R;CN]
[[N-];!R;CO]
[[N-];!R;CS]
[[N-];!R;NS]
[[N-];!R;N]
[[N-];R;CC]
[[N-];R;CN]
[[N-];R;CO]
[[N-];R;CS]
[[NH+];!R;CCC]
[[NH+];!R;CC]
[[NH+];!R;CN]
[[NH+];!R;CO]
[[NH+];!R;CP]
[[NH+];R;CCC]
[[NH+];R;CC]
[[NH+];R;CN]
[[NH+];R;CO]
[[NH2+];!R;CC]
[[NH2+];!R;CN]
[[NH2+];!R;C]
[[NH2+];R;CC]
[[NH2+];R;CN]
[[NH3+];!R;C]
[[NH3+];!R;N]
[[O+];R;CN]
[[O-];!R;C]
[[O-];!R;N]
[[O-];!R;P]
[[O-];!R;S]
[[P@@];!R;CCCO]
[[P@@];!R;CCNN]
[[P@@];!R;CCNO]
[[P@@];!R;CCOO]
[[P@@];!R;CNOO]
[[P@@];!R;COOO]
[[P@@];R;CCCO]
[[P@@];R;CCOO]
[[P@@];R;NOOO]
[[P@@];R;OOOO]
[[P@H];!R;OOO]
[[P@];!R;CCNN]
[[P@];!R;CCNO]
[[P@];!R;CCOO]
[[P@];!R;CNOO]
[[P@];!R;COOO]
[[P@];!R;NNOO]
[[P@];!R;NOOO]
[[P@];R;CCCO]
[[P@];R;CNNO]
[[PH+];!R;CCC]
[[PH+];!R;CCN]
[[S+];!R;CCC]
[[S-];!R;C]
[[S@@];!R;CCNO]
[[S@@];!R;CCN]
[[S@@];!R;CCO]
[[S@@];!R;CNNO]
[[S@@];!R;CNOO]
[[S@@];!R;CNO]
[[S@@];!R;COO]
[[S@@];R;CCNO]
[[S@@];R;CCO]
[[S@];!R;CCNO]
[[S@];!R;CCN]
[[S@];!R;CCO]
[[S@];!R;CNNO]
[[S@];!R;CNOO]
[[S@];!R;CNO]
[[S@];!R;NOO]
[[S@];R;CCNO]
[[S@];R;CCO]
[[[N@@H]+];!R;CCC]
[[[N@@H]+];R;CCC]
[[[N@@H]+];R;CCN]
[[[N@H]+];!R;CCC]
[[[N@H]+];R;CCC]
[[n+];R;CCC]
[[n+];R;CCN]
[[n+];R;CCO]
[[n+];R;CCS]
[[n+];R;CNN]
[[n+];R;CNO]
[[n+];R;COO]
[[n+];R;NNN]
[[n-];R;CC]
[[n-];R;CN]
[[n-];R;CO]
[[n-];R;CS]
[[n-];R;NN]
[[n-];R;NO]
[[n-];R;NS]
[[nH+];R;CC]
[[nH+];R;CN]
[[o+];R;CC]
[[o+];R;CN]
[[s+];R;CC]
[[s+];R;CN]
[c;R;BrCC]
[c;R;BrCN]
[c;R;BrCO]
[c;R;BrCS]
[c;R;BrNN]
[c;R;BrNO]
[c;R;BrNS]
[c;R;CCC]
[c;R;CCCl]
[c;R;CCF]
[c;R;CCI]
[c;R;CCN]
[c;R;CCO]
[c;R;CCP]
[c;R;CCS]
[c;R;CCSi]
[c;R;CClN]
[c;R;CClO]
[c;R;CClS]
[c;R;CFN]
[c;R;CFO]
[c;R;CFS]
[c;R;CIN]
[c;R;CIO]
[c;R;CIS]
[c;R;CNN]
[c;R;CNO]
[c;R;CNP]
[c;R;CNS]
[c;R;CNSi]
[c;R;COO]
[c;R;COP]
[c;R;COS]
[c;R;CSS]
[c;R;ClNN]
[c;R;ClNO]
[c;R;ClNS]
[c;R;FNN]
[c;R;INN]
[c;R;INO]
[c;R;INS]
[c;R;NNN]
[c;R;NNO]
[c;R;NNP]
[c;R;NNS]
[c;R;NOO]
[c;R;NOS]
[c;R;NSS]
[c;R;OOO]
[c;R;OOS]
[c;R;OSS]
[c;R;SSS]
[cH;R;CC]
[cH;R;CN]
[cH;R;CO]
[cH;R;CS]
[cH;R;NN]
[cH;R;NO]
[cH;R;NS]
[n;R;BrCN]
[n;R;CCC]
[n;R;CCF]
[n;R;CCN]
[n;R;CCO]
[n;R;CCP]
[n;R;CCS]
[n;R;CCSi]
[n;R;CC]
[n;R;CNN]
[n;R;CNO]
[n;R;CNS]
[n;R;CN]
[n;R;CO]
[n;R;CS]
[n;R;NN]
[n;R;NO]
[n;R;NS]
[nH;R;CC]
[nH;R;CN]
[nH;R;CO]
[nH;R;CS]
[nH;R;NN]
[o;R;CC]
[o;R;CN]
[o;R;NN]
[p;R;CC]
[s;R;CC]
[s;R;CN]
[s;R;CS]
[s;R;NN]
\
